Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱིན་པ་སྦྱིན་ཞིང་བྱིན་ནས་ཀྱང་སེམས་ཅན་དེ་དག་ཉིད་ལ་གཏོང་ཡང་སེམས་ཅན་དེ་དག་ཀྱང་མི་དམིགས།
en: “Moreover, Śāradvatī­putra, great bodhisattva beings offer gifts to all sentient beings, and even after making their gifts, they practice liberality toward those same beings, but they do not apprehend those sentient beings.

source: ལེན་པ་པོ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: They do not consider the recipient.

source: སྦྱིན་པ་དེའི་རྣམ་པར་སྨིན་པ་ལ་ཡང་མངོན་པར་དགའ་བ་མེད་ལ།
en: They do not even rejoice in the ripening impact of their giving.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་ཡོངས་སུ་སྔོ་མོད་ཀྱི། མཚན་མ་ཕྲ་རབ་ཙམ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་ནི།
en: Although they also dedicate their gifts for the sake of unsurpassed, genuinely perfect enlightenment, they do not consider even the slightest indication [of anything].

source: ཤ་ར་དྭ་ཏིའི་བུ་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །
en: This, Śāradvatī­putra, is called the transcendent perfection of supramundane generosity.

source: དེ་ཅིའི་ཕྱིར་འཇིག་རྟེན་ལས་འདས་པ་ཞེས་བྱ་ཞེ་ན། འདི་ལྟར་འཇིག་རྟེན་ལས་རྒལ་ཞིང་འཇིག་རྟེན་ལས་འཕགས་ལ།
en: If you ask why it is called the transcendent perfection of supramundane generosity, it is because it goes beyond the mundane, it is superior to the mundane, and transcends the mundane.

source: འཇིག་རྟེན་ལས་ཡང་དག་པར་འདས་ཏེ། དེ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །
en: [For that reason], it is called the transcendent perfection of supramundane generosity.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། གནས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་འཇིག་རྟེན་པ་ཡིན་ལ། མི་གནས་པ་ནི་འཇིག་རྟེན་ལས་འདས་པ་སྟེ།
en: “In the same vein, the abiding mode of the transcendent perfection of ethical discipline is mundane, and its non-abiding mode is supramundane.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་ཇི་སྐད་བསྟན་པ་དེ་ཁོ་ན་བཞིན་དུ་རྒྱ་ཆེར་སྦྱར་བར་བྱའོ། །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: What has already been said for the transcendent perfection of generosity should be fully applied here, and also for the transcendent perfection of tolerance, the transcendent perfection of perseverance, and the transcendent perfection of meditative concentration.

source: གནས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་འཇིག་རྟེན་པ་ཡང་ཡིན་ལ། མི་གནས་པ་ནི་འཇིག་རྟེན་ལས་འདས་པའོ། །
en: The abiding mode of the transcendent perfection of wisdom is mundane, and its non-abiding mode is supramundane.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: “Śāradvatī­putra, just as great bodhisattva beings perfect the mundane and supramundane transcendent perfection of generosity, so it is that they perfect the other transcendent perfections, up to and including the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དེ་ཡང་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་དང་། གོ་ཆ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ཡིན་ནོ། །
en: This indeed, Śāradvatī­putra, is the Great Vehicle of great bodhisattva beings, their great armor, and the maturity of the bodhisattvas.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ལས་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པའི་ལེའུ་ཞེས་བྱ་སྟེ་དགུ་པའོ།། །།
en: This completes the ninth chapter from “The Transcendent Perfection of Wisdom in Ten Thousand Lines,” entitled “Teaching.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Extrasensory Powers Chapter 10 Then, the venerable Su­bhūti asked the Blessed One, “Reverend Lord!

source: བཅོམ་ལྡན་འདས་ཅི་ཙམ་གྱིས་ན་གོ་ཆ་ཆེན་པོ་བགོས་པ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བགྱི་བ་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: When it is said that they should don the great armor, what is the extent of the great armor that they should don?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆ་བགོས། དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་གྱི་གོ་ཆ་བགོས།
en: The Blessed One then addressed the venerable Su­bhūti as follows: “Su­bhūti, great bodhisattva beings should don the armor of the transcendent perfection of generosity, and similarly, they should don the armor of the other transcendent perfections, up to and including the transcendent perfection of wisdom.

source: དྲན་པ་ཉེ་བར་གཞག་པའི་གོ་ཆ་བགོས། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་གྱི་གོ་ཆ་བགོས།
en: They should don the armor of the applications of mindfulness, and don the armor of [the other causal attributes], up to and including the noble eightfold path.

source: ནང་སྟོང་པ་ཉིད་ཀྱི་གོ་ཆ་བགོས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་གོ་ཆ་བགོས།
en: They should don the armor of the emptiness of internal phenomena, and don the armor of the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་གོ་ཆ་བགོས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་གྱི་གོ་ཆ་བགོས།
en: Similarly, they should don the armor of the ten powers of the tathāgatas, and they should don the armor of the [other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་གོ་ཆ་བགོས།
en: They should don the armor of [the attainments], up to and including omniscience.

source: སངས་རྒྱས་ཀྱི་སྐུའི་གོ་ཆ་བགོས་ནས།
en: They should don the armor of the buddha body.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བས་ཁྱབ་པར་བྱེད་དོ། །
en: Then they will illuminate the world system of the great trichiliocosm.

source: དེ་བཞིན་དུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་སྣང་བས་ཁྱབ་པར་བྱེད་དོ། །
en: “In the same manner, they illuminate the world systems of the eastern direction, numerous as the sands of the River Ganges.

source: དེ་བཞིན་དུ་ཕྱོགས་མཚམས་ཀྱི་བར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་སྣང་བས་ཁྱབ་པར་བྱེད་དོ། །
en: Similarly, they illuminate the world systems of the other directions, up to and including the intermediate directions, numerous as the sands of the River Ganges.

source: ཁྱབ་པར་བྱས་ནས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པ་དྲུག་ཏུ་གཡོ་བར་བྱེད། རབ་ཏུ་གཡོ་བར་བྱེད། ཀུན་ཏུ་རབ་ཏུ་གཡོ་བར་བྱེད་དོ། །
en: Having permeated [all directions with light], they cause the world systems of the great trichiliocosm to shake, to shake more intensely, and to shake with utmost intensity, and in six ways.

source: དེ་བཞིན་དུ་ཤར་ཕྱོགས་ནས་ཕྱོགས་མཚམས་ཀྱི་བར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རྣམ་པ་དྲུག་ཏུ་གཡོ་བར་བྱེད། རབ་ཏུ་གཡོ་བར་བྱེད། ཀུན་ཏུ་རབ་ཏུ་གཡོ་བར་བྱེད་དོ། །
en: In the same manner, they cause the chiliocosm, extending from the eastern direction up to and including the intermediate directions, numerous as the sands of the River Ganges, to shake, to shake more intensely, and to shake with utmost intensity, and in six ways.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སྣང་བ་དེས་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆ་བགོས་པ་ནས། སངས་རྒྱས་ཀྱི་སྐུའི་བར་གྱི་གོ་ཆ་བགོས་པ་ཡིན་ནོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་བཻ་དཱུརྱའི་རང་བཞིན་དུ་མངོན་པར་སྤྲུལ་པར་བྱེད་དོ། །མངོན་པར་སྤྲུལ་ནས་ཀྱང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་བཀོད་པ་མངོན་པར་སྤྲུལ་པར་བྱེད་ཅིང་། དེས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་བཀོད་པ་མངོན་པར་སྤྲུལ་ནས་ཀྱང་ཟས་འདོད་པ་རྣམས་ལ་ཟས་སྦྱིན་པར་བྱེད། དེ་བཞིན་དུ་བཏུང་བ་ནས། གོས་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་།
en: It is by means of this illumination that great bodhisattva beings don the armor of the transcendent perfection of generosity, and of the [other attributes], up to and including the buddha body.

source: ཁང་པ་དང་། གནས་དང་། མར་མེ་དང་། སྨན་དུ་སྦྱར་བ་དང་། སྨན་གྱི་བར་དུ་སྦྱིན་པར་བྱེད་པ་དང་།
en: “They emanate the world systems of the great trichiliocosm as a natural expanse of beryl, and having done so, they emanate the array of a universal monarch, and having emanated the array of a universal monarch, they give food to all those in need of nourishment, and similarly, they give drink, clothing, garlands, incense, unguents, homes, lodgings, lamps, and so on, up to and including medicines.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། མིའི་ཡོ་བྱད་གང་ཡང་རུང་བའི་བར་དག་སེམས་ཅན་དག་ལ་སྦྱིན་པར་བྱེད་ཅིང་། དེས་སྦྱིན་པ་དེ་ལྟ་བུ་བྱིན་ནས། སེམས་ཅན་དེ་དག་ཉིད་ལ་འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་ཆོས་འདི་དག་ཉིད་ཀྱི་ཆོས་སྟོན་ཏོ། །
en: In the same vein, they dispense other benefits to sentient beings, including appropriate human resources, and having made such gifts, they then teach sentient beings the sacred doctrine that is endowed with the six transcendent perfections.

source: སེམས་ཅན་དེ་དག་ཀྱང་ཆོས་དེ་ཐོས་ནས། ནམ་ཡང་ལོག་པར་ལྟུང་བར་མི་ལྟུང་ལ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ་ནམ་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་འབྲལ་བར་མི་འགྱུར་ཏེ།
en: Those sentient beings, too, on hearing sacred doctrine, will never commit transgressions, and will never be separated from the six transcendent perfections until they have attained manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.

source: རབ་འབྱོར་དེ་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ། །
en: Su­bhūti, it is to that extent that great bodhisattva beings are said to don the great armor.

source: རབ་འབྱོར་དཔེར་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་སྟེ། སྐྱེ་བོ་ཕལ་པོ་ཆེའི་མདུན་དུ་ཟས་འདོད་པ་དག་ལ་ཟས་སྦྱིན་པ་ནས་མིའི་ཡོ་བྱད་གང་ཡང་རུང་བའི་བར་དུ་བྱིན་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མས་སེམས་ཅན་གང་ལ་ཡང་སྦྱིན་པ་བྱིན་པ་ཡོད་སྙམ་འམ་གསོལ་པ།
en: “Su­bhūti, if, for example, an illusionist or the apprentice of an illusionist, standing at a crossroads, in the presence of a large gathering of people, were to offer food to those in need of nourishment, and dispense [all those other aforementioned] gifts, up to and including the appropriate human resources, do you think, Su­bhūti, that this illusionist or this apprentice of an illusionist would have dispensed any gift to any sentient being?”

source: རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་བཀོད་པ་མངོན་པར་སྤྲུལ་ནས། ཟས་འདོད་པ་དག་ལ་ཟས་སྦྱིན་པར་བྱེད་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། མིའི་ཡོ་བྱད་གང་ཡང་རུང་བའི་བར་དག་སྦྱིན་པར་བྱེད་ཀྱང་སེམས་ཅན་གང་ལ་ཡང་སྦྱིན་པ་ཅི་ཡང་བྱིན་པ་མེད་དོ། །
en: The Blessed One then said, “Su­bhūti, in the same manner, great bodhisattva beings, having emanated the array of a universal monarch, proceed to offer food to those in need of nourishment, and in the same vein, they grant [the other aforementioned] gifts up to and including the appropriate human resources, but they have not actually dispensed any gifts to any sentient being.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྒྱུ་མའི་ཆོས་ཉིད་ཉེ་བར་བཟུང་ན། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་ཡིན་པའི་ཕྱིར་རོ། །
en: If you ask why, it is because, commencing from the reality of illusion, such is the reality of all things.

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། བསམས་བཞིན་དུ་སྐྱེ་བ་ཡོངས་སུ་བཟུང་བས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་རིགས་སུ་སྐྱེ་སྟེ།
en: “Moreover, Su­bhūti, when great bodhisattva beings abide in the transcendent perfection of ethical discipline, they will be reborn in the family of a universal monarch, since they are able to take birth at will.

source: འཁོར་ལོས་སྒྱུར་བའི་རིགས་ཀྱི་དབང་ཕྱུག་དེ་ལ་གནས་ནས། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་འགོད་པར་བྱེད།
en: Dwelling as mighty lords in the family of a universal monarch, they will establish sentient beings, many hundreds of billion trillions in number, on the path of the ten virtuous actions.

source: དེ་བཞིན་དུ་བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དག་ལ་འགོད་པར་བྱེད།
en: Likewise, they will establish them in the four meditative concentrations, the four immeasurable aspirations, and the four formless absorptions.

source: དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་།
en: The same goes for the four applications of mindfulness, and so on, up to and including the noble eightfold path, and the three gateways to liberation.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་ལ་འགོད་པར་བྱེད་དེ།
en: They will also establish them in the [fruitional attributes], from the ten powers of the tathāgatas up to and including the eighteen distinct qualities of the buddhas.

source: སེམས་ཅན་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ་ནམ་ཡང་ཆོས་བསྟན་པ་དེ་དག་དང་བྲལ་བར་མི་འགྱུར་རོ། །རབ་འབྱོར་དཔེར་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ཞིག་མངོན་པར་སྤྲུལ་ནས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Those sentient beings, too, will never be separated from the teachings of the sacred doctrine until they have attained manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་ལ་བཀོད་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་སྒྱུ་མའི་སྐྱེས་བུའམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་དེས་དེ་ལ་སེམས་ཅན་འགའ་ཡང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པ་ཡོད་སྙམ་འམ། དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་ལ་བཀོད་པ་ཡོད་སྙམ་འམ།
en: “Su­bhūti, if, for example, an illusionist or the apprentice of an illusionist had conjured up a large gathering of people and established them on the path of the ten virtuous actions, and so on, until he had established them in the eighteen distinct qualities of the buddhas, do you think, Su­bhūti, that this illusionist or this apprentice of an illusionist would have established any sentient beings on the path of the ten virtuous actions, and in the same vein, do you think he would have established anyone in [those other attributes], up to and including the eighteen distinct qualities of the buddhas?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་མཆིས་ལགས་སོ། །
en: “No, Reverend Lord!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པ་དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་ལ་བཀོད་ཀྱང་སེམས་ཅན་འགའ་ཡང་བཀོད་པ་མེད་དོ། །
en: The Blessed One then said, “Su­bhūti, in the same manner, great bodhisattva beings establish sentient beings, many hundreds of billion trillions in number, on the path of the ten virtuous actions, and in the same vein, establish them [in the other attributes], up to and including the eighteen distinct qualities of the buddhas, but they have not actually established any sentient beings at all.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སྒྱུ་མའི་ཆོས་ཉིད་ཉེ་བར་བཟུང་ན། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་ཡིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, Su­bhūti, it is because, commencing with the reality of illusion, this is in fact the reality of all things.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ། །
en: Su­bhūti, so it is that great bodhisattva beings are said to don the great armor.

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་བཟོད་པ་ལ་འགོད་པར་བྱེད་དོ། །
en: “Moreover, Su­bhūti, when great bodhisattva beings abide in the transcendent perfection of tolerance, they will establish sentient beings, many hundreds of billion trillions in number, in tolerance.

source: རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་བཟོད་པ་ལ་འགོད་པར་བྱེད་ཅེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ། གོ་ཆ་འདི་ལྟར་གྱོན་པར་བྱེད་དེ། གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་འོངས་ནས། བདག་ལ་དབྱུག་པ་དང་། མཚོན་ཆ་དང་། བོང་བ་དག་གིས་བསྣུན་ཀྱང་དེ་ལ་བདག་གིས་སེམས་ཅན་གང་ལ་ཡང་འཁྲུག་པ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་འགའ་ཡང་བསྐྱེད་པར་མི་བྱའི་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བཟོད་པ་དེ་ལྟ་བུ་ལ་དགོད་པར་བྱའོ་སྙམ་མོ། །
en: Su­bhūti, if one were to ask in what way great bodhisattva beings, abiding in the transcendent perfection of tolerance, establish sentient beings, one hundred billion trillions in number, in tolerance, in this regard, Su­bhūti, from the time when they first begin to set their mind on enlightenment, great bodhisattva beings don their armor, while thinking, ‘If all sentient beings were to approach me, and even strike me with sticks, weapons, or clods of earth, I would not generate any thoughts of anger toward any sentient beings, and I would indeed establish all sentient beings in such patient endurance.’

source: དེས་གོ་ཆ་དེ་ལྟ་བུ་བགོས་ནས་དགྲ་བོ་དང་ཕྱིར་རྒོལ་བ་དག་གིས་བོང་བ་དང་། དབྱུག་པ་དང་། མཚོན་གྱིས་གདབ་པ་དག་གིས་ཉོན་མོངས་ན་ཡང་ནམ་ཡང་སེམས་ཅན་གང་ལ་ཡང་འཁྲུག་པ་དང་ལྡན་པའི་སེམས་མི་སྐྱེད་ཀྱི། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་བཟོད་པ་དེ་ལྟ་བུ་ལ་འགོད་པར་བྱེད་དོ། །
en: Having donned their armor, even if they were afflicted on being struck by the clods of earth, sticks, or weapons hurled by enemies and assailants, they would never generate a thought of anger toward any sentient beings, but instead they would establish sentient beings, one hundred billion trillions in number, in such patient endurance.

source: རབ་འབྱོར་དཔེར་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ཞིག་མངོན་པར་སྤྲུལ་ནས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བཀོད་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་སྒྱུ་མའི་སྐྱེས་བུའམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་དེས་དེ་ལ་སེམས་ཅན་འགའ་ཡང་བཟོད་པ་ལ་བཀོད་པ་ཡོད་སྙམ་མམ།
en: “Su­bhūti, if, for example, an illusionist or the apprentice of an illusionist had conjured up a large gathering of people, and established them in the transcendent perfection of tolerance, do you think, Su­bhūti, that this illusionist or this apprentice of an illusionist would have established any sentient beings in tolerance?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་བཟོད་པ་ལ་བཀོད་ཀྱང་སེམས་ཅན་འགའ་ཡང་བཀོད་པ་མེད་དོ། །
en: The Blessed One then said, “Su­bhūti, in the same manner, great bodhisattva beings establish sentient beings, many hundreds of billion trillions in number, in tolerance, but they have not actually established any sentient beings at all.

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་པར་བྱེད།
en: “Moreover, Su­bhūti, when great bodhisattva beings abide in the transcendent perfection of perseverance, they will encourage, secure, and establish sentient beings, one hundred billion trillion in number, in the transcendent perfection of perseverance.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་མི་དགེ་བའི་ཆོས་སྤང་བའི་ཕྱིར་དང་། དགེ་བའི་ཆོས་ཕུན་སུམ་ཚོགས་པར་བྱ་བའི་ཕྱིར་སེམས་ཅན་དེ་དག་ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་པར་བྱེད་དོ། །
en: Their minds endowed with omniscience, they will encourage, secure, and establish those sentient beings in physical and mental perseverance, in order that they might abandon non-virtuous doctrines and undertake the excellent virtuous doctrines.

source: རབ་འབྱོར་དཔེར་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ཞིག་མངོན་པར་སྤྲུལ་ནས། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་པར་བྱེད་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་སྒྱུ་མའི་སྐྱེས་བུ་འམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་དེས་དེ་ལ་སེམས་ཅན་འགའ་ཡང་བརྩོན་འགྲུས་ལ་བཀོད་པ་ཡོད་དམ།
en: “Su­bhūti, if, for example, an illusionist or the apprentice of an illusionist had conjured up a large gathering of people, and then encouraged, secured, and established sentient beings, one hundred billion trillion in number, in the transcendent perfection of perseverance, do you think, Su­bhūti, that this illusionist or this apprentice of an illusionist would have established any sentient beings in perseverance?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བཀོད་ཀྱང་སེམས་ཅན་འགའ་ཡང་བཀོད་པ་མེད་དོ། །
en: The Blessed One then said, “Su­bhūti, in the same manner, great bodhisattva beings establish sentient beings, many hundreds of billion trillions in number, in the transcendent perfection of perseverance, but they have not actually established any sentient beings at all.

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་པར་བྱེད་དོ། །
en: “Moreover, Su­bhūti, when great bodhisattva beings abide in the transcendent perfection of meditative concentration, they will encourage, secure and establish sentient beings, one hundred billion trillion in number, in the transcendent perfection of meditative concentration.

source: རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་པར་བྱེད་ཅེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ལ་གནས་ནས། ཆོས་གང་ཡང་མཉམ་པར་གཞག་པའམ། རྣམ་པར་གཡེང་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: Su­bhūti, if one were to ask in what way great bodhisattva beings, abiding in the transcendent perfection of meditative concentration, encourage, secure and establish sentient beings, one hundred billion trillion in number, in the transcendent perfection of meditative concentration, in this regard, Su­bhūti, great bodhisattva beings abide in the meditative stability of sameness with regard to all things, and they do not consider whether anything is in absorption or distracted.

source: དེ་དེ་ཁོ་ན་བཞིན་དུ་སེམས་ཅན་དེ་དག་བསམ་གཏན་དེ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་པར་བྱེད་ལ། ཅི་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ་ནམ་ཡང་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་བྲལ་བར་མི་འགྱུར་བ་དེ་ལྟར་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་དེ་རབ་ཏུ་འགོད་པར་བྱེད་དོ། །
en: In that manner exclusively they encourage, secure and establish sentient beings in meditative concentration; and, in various ways, they encourage, secure and establish them, so that they will never be separated from the transcendent perfection of meditative concentration until they have attained manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.”

source: རབ་འབྱོར་དཔེར་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ཞིག་མངོན་པར་སྤྲུལ་ནས། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་རབ་ཏུ་བཀོད་ན། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་སྒྱུ་མའི་སྐྱེས་བུའམ།
en: “Su­bhūti, if, for example, an illusionist or the apprentice of an illusionist, had conjured up a large gathering of people, and then encouraged, secured and established sentient beings, one hundred billion trillion in number, in the transcendent perfection of meditative concentration, do you think, Su­bhūti, that this illusionist or the apprentice of an illusionist would have established any sentient beings in the transcendent perfection of meditative concentration?”

source: སྒྱུ་མ་མཁན་གྱི་སློབ་མ་དེས་དེ་ལ་སེམས་ཅན་འགའ་ཡང་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བཀོད་པ་ཡོད་སྙམ་འམ།
en: “No, Reverend Lord!”
